In [1]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('downloads/broadcast.csv', index_col=0)

In [8]:
df

         KBS     MBC     SBS  TV CHOSUN   JTBC  Channel A    MBN
2011  35.951  18.374  11.173      9.102  7.380      3.771  2.809
2012  36.163  16.022  11.408      8.785  7.878      5.874  3.310
2013  31.989  16.778   9.673      9.026  7.810      5.350  3.825
2014  31.210  15.663   9.108      9.440  7.490      5.776  4.572
2015  27.777  16.573   9.099      9.940  7.267      6.678  5.520
2016  27.583  14.982   8.669      9.829  7.727      6.624  5.477
2017  26.890  12.465   8.661      8.886  9.453      6.056  5.215

In [11]:
kbs_df = df.loc[:,'KBS']
kbs_df

2011    35.951
2012    36.163
2013    31.989
2014    31.210
2015    27.777
2016    27.583
2017    26.890
Name: KBS, dtype: float64

In [14]:
kbs_2016_df = df.loc[2016, 'KBS']
kbs_2016_df

27.583000000000002

In [17]:
sbs_df = df['SBS']
sbs_df

2011    11.173
2012    11.408
2013     9.673
2014     9.108
2015     9.099
2016     8.669
2017     8.661
Name: SBS, dtype: float64

In [20]:
two_df = df[['KBS', 'SBS']]
two_df

         KBS     SBS
2011  35.951  11.173
2012  36.163  11.408
2013  31.989   9.673
2014  31.210   9.108
2015  27.777   9.099
2016  27.583   8.669
2017  26.890   8.661

In [22]:
new_df = df.loc[2012:2016, 'KBS':'JTBC']
new_df

         KBS     MBC     SBS  TV CHOSUN   JTBC
2012  36.163  16.022  11.408      8.785  7.878
2013  31.989  16.778   9.673      9.026  7.810
2014  31.210  15.663   9.108      9.440  7.490
2015  27.777  16.573   9.099      9.940  7.267
2016  27.583  14.982   8.669      9.829  7.727

In [24]:
#show years which watching rate is more than 30%
df['KBS'] > 30

2011     True
2012     True
2013     True
2014     True
2015    False
2016    False
2017    False
Name: KBS, dtype: bool

In [25]:
boolean_KBS = df['KBS'] > 30
#below doesn't work to show kbs>30 results
df.loc[boolean_KBS]

         KBS     MBC     SBS  TV CHOSUN   JTBC  Channel A    MBN
2011  35.951  18.374  11.173      9.102  7.380      3.771  2.809
2012  36.163  16.022  11.408      8.785  7.878      5.874  3.310
2013  31.989  16.778   9.673      9.026  7.810      5.350  3.825
2014  31.210  15.663   9.108      9.440  7.490      5.776  4.572

In [26]:
#to do it work, designate 'KBS' again
df.loc[boolean_KBS, 'KBS']

2011    35.951
2012    36.163
2013    31.989
2014    31.210
Name: KBS, dtype: float64

In [31]:
# 주어진 데이터에서 SBS가 TV CHOSUN보다 더 시청률이 낮았던 시기의 데이터를 확인해보려고 합니다.r
raw_df = df[['SBS', 'TV CHOSUN']]
condition = raw_df['SBS'] < raw_df['TV CHOSUN']
raw_df[condition]

        SBS  TV CHOSUN
2014  9.108      9.440
2015  9.099      9.940
2016  8.669      9.829
2017  8.661      8.886